Project/Toir.Adaptation/src/InformationRegisters/торо_ВерсииТехКарт/торо_ВерсииТехКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВерсииТехКарт</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>ИдентификаторТехКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/InformationRegisters/торо_ТекущиеСтатусыСогласованияДокументов/торо_ТекущиеСтатусыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТекущиеСтатусыСогласованияДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>СтатусДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>СогласуемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir.Adaptation/src/Catalogs/торо_ТехКарты/торо_ТехКарты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ТехКарты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НормаВремениТекст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СодержитОпасныеОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СодержитРаботыПовышеннойОпасности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПростояТекст</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаПринятия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВыполнениеРемонтаТребуетОстановаОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидПростоя</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="318cfb02-93d9-4e72-b18b-d94c75743551">
    <name>гкс_ШаблонОригинал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3596ff4d-323b-42dc-9670-b09c4c53eb1a">
    <name>гкс_ПериодДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c8b1bb05-348c-4004-a9c7-f4334bfd4798">
    <name>гкс_ДатаОкончанияАктуальности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cda9ddcc-962a-45a2-b3c3-e94d16217457">
    <name>гкс_КоличествоПериодовДействия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>СписокОпераций</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Продолжительность</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НормаВремениВСекундах</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>11</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="00e732b3-dcfc-4752-8d6d-92d8a2df1df3">
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fbc4c1a4-e43e-422b-b50e-564f58400e1c">
      <name>гкс_Примечание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТрудовыеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ВремяРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Квалификация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериальныеЗатраты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнструментыИТехника</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Операция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Инструмент</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="b4f819bb-d0da-4bc8-9121-c57956d6248f">
    <name>ИзмеряемыеПоказатели</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="4723efe0-b00c-4604-ae16-cebdc894e7a4">
      <name>гкс_ТребуемыйРезультатИзмерения</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="8c232819-8c55-4920-9838-1aa96476a92f">
    <name>гкс_ИспытанияОборудования</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="af1662b9-55f3-4d05-b29c-04399c6b9e0f">
      <name>ИспытаниеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Project/Toir.Adaptation/src/CommonModules/торо_ЗаполнениеДокументов/Module.bsl
&ИзменениеИКонтроль("ПолучитьСписокОперацийТехкартыСНормативами")
Функция Расш_гкс_ПолучитьСписокОперацийТехкартыСНормативами(ТехКарта, ЭтоРегламентныеМероприятия)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	торо_ТехКартыСписокОпераций.ID КАК ID,
	|	торо_ТехКартыСписокОпераций.Операция КАК Операция,
	|	торо_ТехКартыСписокОпераций.Количество КАК Количество,
	|	торо_ТехКартыСписокОпераций.Ссылка КАК Ссылка
	#Вставка
	|	,торо_ТехКартыСписокОпераций.гкс_Примечание КАК гкс_Примечание
	|	,торо_ТехКартыСписокОпераций.СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ПОМЕСТИТЬ СписокОпераций_Данные
	|ИЗ
	|	Справочник.торо_ТехКарты.СписокОпераций КАК торо_ТехКартыСписокОпераций
	|ГДЕ
	|	торо_ТехКартыСписокОпераций.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОпераций.ID КАК ID,
	|	СписокОпераций.Операция КАК Операция,
	|	СписокОпераций.Количество КАК Количество
	#Вставка
	|	,СписокОпераций.гкс_Примечание КАК гкс_Примечание
	|	,СписокОпераций.гкс_СпособВыполнения КАК гкс_СпособВыполнения
	#КонецВставки
	|ИЗ
	|	СписокОпераций_Данные КАК СписокОпераций
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОпераций.ID КАК ID,
	|	СписокОпераций.Операция КАК Операция,
	|	СписокОпераций.Количество КАК Количество,
	|	СписокОпераций.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ СписокОпераций
	|ИЗ
	|	СписокОпераций_Данные КАК СписокОпераций
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(СписокОпераций.Операция) = ТИП(Справочник.торо_ТехнологическиеОперации)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ID,
	|	Операция,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТехКартыМатериальныеЗатраты.ID КАК ID,
	|	торо_ТехКартыМатериальныеЗатраты.Номенклатура КАК Номенклатура,
	|	торо_ТехКартыМатериальныеЗатраты.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	торо_ТехКартыМатериальныеЗатраты.Упаковка КАК Упаковка,
	|	ЕСТЬNULL(торо_ТехКартыМатериальныеЗатраты.Упаковка.Коэффициент, 0) КАК Коэффициент,
	|	торо_ТехКартыМатериальныеЗатраты.Количество КАК КоличествоЕдиниц,
	|	торо_ТехКартыМатериальныеЗатраты.КоличествоНаЕдиницу КАК КоличествоНаЕдиницу,
	|	торо_ТехКартыМатериальныеЗатраты.КоличествоУпаковок КАК Количество,
	|	торо_ТехКартыМатериальныеЗатраты.КоличествоУпаковокНаЕдиницу КАК КоличествоУпаковокНаЕдиницу,
	|	торо_ТехКартыМатериальныеЗатраты.Характеристика КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	СписокОпераций КАК СписокОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МатериальныеЗатраты КАК торо_ТехКартыМатериальныеЗатраты
	|		ПО СписокОпераций.ID = торо_ТехКартыМатериальныеЗатраты.ID
	|			И СписокОпераций.Операция = торо_ТехКартыМатериальныеЗатраты.Операция
	|			И СписокОпераций.Ссылка = торо_ТехКартыМатериальныеЗатраты.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	торо_ТехКартыТрудовыеЗатраты.ID КАК ID,
	|	торо_ТехКартыТрудовыеЗатраты.Количество КАК Количество,
	|	торо_ТехКартыТрудовыеЗатраты.Квалификация КАК Квалификация,
	|	торо_ТехКартыТрудовыеЗатраты.ВремяРаботы КАК ВремяРаботы,
	|	торо_ТехКартыТрудовыеЗатраты.ВремяРаботыНаЕдиницу КАК ВремяРаботыНаЕдиницу
	|ИЗ
	|	СписокОпераций КАК СписокОпераций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.ТрудовыеЗатраты КАК торо_ТехКартыТрудовыеЗатраты
	|		ПО СписокОпераций.ID = торо_ТехКартыТрудовыеЗатраты.ID
	|			И СписокОпераций.Операция = торо_ТехКартыТрудовыеЗатраты.Операция
	|			И СписокОпераций.Ссылка = торо_ТехКартыТрудовыеЗатраты.Ссылка";

	Если Не ЭтоРегламентныеМероприятия Тогда
		Запрос.Текст = Запрос.Текст + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	торо_ТехКартыИнструментыИТехника.ID,
		|	торо_ТехКартыИнструментыИТехника.ЕдиницаИзмерения,
		|	торо_ТехКартыИнструментыИТехника.Инструмент,
		|	торо_ТехКартыИнструментыИТехника.Упаковка,
		|	торо_ТехКартыИнструментыИТехника.Количество,
		|	торо_ТехКартыИнструментыИТехника.КоличествоУпаковок
		|ИЗ
		|	СписокОпераций КАК СписокОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.ИнструментыИТехника КАК торо_ТехКартыИнструментыИТехника
		|		ПО СписокОпераций.ID = торо_ТехКартыИнструментыИТехника.ID
		|			И СписокОпераций.Операция = торо_ТехКартыИнструментыИТехника.Операция
		|			И СписокОпераций.Ссылка = торо_ТехКартыИнструментыИТехника.Ссылка
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзМерыБезопасности.ID,
		|	тзМерыБезопасности.МераБезопасности
		|ИЗ
		|	СписокОпераций КАК СписокОпераций
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ТехКарты.МерыБезопасности КАК тзМерыБезопасности
		|		ПО СписокОпераций.ID = тзМерыБезопасности.ID
		|			И СписокОпераций.Операция = тзМерыБезопасности.Операция
		|			И СписокОпераций.Ссылка = тзМерыБезопасности.Ссылка";
	КонецЕсли; 

	Запрос.УстановитьПараметр("Ссылка",ТехКарта);
	Возврат Запрос.ВыполнитьПакет();

КонецФункции

&ИзменениеИКонтроль("ДополнитьСписокОперацийДокументаИЗатраты")
Процедура Расш_гкс_ДополнитьСписокОперацийДокументаИЗатраты(СтруктураДанных, ДокументОбъект, ЭтоРегламентныеМероприятия)

	Родитель_ID            = СтруктураДанных.ID_Родителя;
	РемонтыОборудования_ID = СтруктураДанных.РемонтыОборудования_ID;
	ТехКарта               = СтруктураДанных.РемонтнаяРабота;
	ДатаНачала             = СтруктураДанных.ДатаРемонта;

	РезультатЗапросаПоОперациям = ПолучитьСписокОперацийТехкартыСНормативами(ТехКарта,ЭтоРегламентныеМероприятия);

	СписокОпераций      = РезультатЗапросаПоОперациям[1].Выгрузить();
	МатериальныеЗатраты = РезультатЗапросаПоОперациям[3].Выгрузить();
	ТрудовыеЗатраты     = РезультатЗапросаПоОперациям[4].Выгрузить();


	Если Не ЭтоРегламентныеМероприятия Тогда

		ИнструментыИТехника = РезультатЗапросаПоОперациям[5].Выгрузить();
		МерыБезопасности = РезультатЗапросаПоОперациям[6].Выгрузить();

	КонецЕсли;

	Для каждого СтрокаОперации Из СписокОпераций Цикл

		РемРабота = ДокументОбъект.РемонтныеРаботы.Добавить();
		РемРабота.Родитель_ID            = Родитель_ID;
		РемРабота.РемонтыОборудования_ID = РемонтыОборудования_ID;
		#Вставка
		ВременнаяСтруктура = Новый Структура("гкс_Примечание,гкс_СпособВыполнения,гкс_ПовКоэф", "", Неопределено, Неопределено);
		ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, СтрокаОперации);
		ЗаполнитьЗначенияСвойств(РемРабота, ВременнаяСтруктура);
		#КонецВставки

		Если Не ЭтоРегламентныеМероприятия Тогда
			РемРабота.Количество         = СтрокаОперации.Количество * ?(СтруктураДанных.Свойство("Количество") И СтруктураДанных.Количество <> 0, СтруктураДанных.Количество, 1);
		Иначе
			РемРабота.Количество         = СтрокаОперации.Количество;
		КонецЕсли;

		МассивИмеющихсяID =  ДокументОбъект.РемонтныеРаботы.НайтиСтроки(Новый Структура("ID", СтрокаОперации.ID));
		Если МассивИмеющихсяID.Количество() > 0 Тогда
			ИДРаботы = Новый УникальныйИдентификатор;
		Иначе
			ИДРаботы = СтрокаОперации.ID;
		КонецЕсли; 
		РемРабота.ID                     = ИДРаботы;
		РемРабота.РемонтнаяРабота        = СтрокаОперации.Операция;

		РемРабота.Картинка               = ?(ТипЗнч(РемРабота.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации"),2,0);

		// процент выполнения пока не сделано
		Если ТипЗнч(РемРабота.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ТехнологическиеОперации") Тогда //заполняем нормативы

			МассивСтрок = МатериальныеЗатраты.НайтиСтроки(новый Структура("ID",СтрокаОперации.ID));

			Для каждого СтрокаМатериалов Из МассивСтрок Цикл
				Если СтрокаМатериалов.КоличествоЕдиниц = 0 Тогда
					СтрокаМатериалов.КоличествоЕдиниц = (?(СтрокаМатериалов.Коэффициент = 0, 1, СтрокаМатериалов.Коэффициент)) * СтрокаМатериалов.Количество;
				КонецЕсли; 

				НСМатериалов = ДокументОбъект.МатериальныеЗатраты.Добавить();
				ЗаполнитьЗначенияСвойств(НСМатериалов,СтрокаМатериалов);
				НСМатериалов.РемонтыОборудования_ID = РемонтыОборудования_ID;
				НСМатериалов.ID                     = РемРабота.ID;
				НСМатериалов.ЕдиницаИзмерения		= СтрокаМатериалов.Упаковка;

			КонецЦикла; 

			Если ТрудовыеЗатраты <> Неопределено Тогда

				МассивСтрок = ТрудовыеЗатраты.НайтиСтроки(новый Структура("ID",СтрокаОперации.ID));

				Для каждого СтрокаТрудозатрат Из МассивСтрок Цикл

					// в заявке нет детализации до исполнителей 
					Если ТипЗнч(ДокументОбъект.Ссылка) <> Тип("ДокументСсылка.торо_ЗаявкаНаРемонт") Тогда
						Для Счетчик = 1 По СтрокаТрудозатрат.Количество Цикл
							НСТрудозатрат = ДокументОбъект.ТрудовыеЗатраты.Добавить();
							ЗаполнитьЗначенияСвойств(НСТрудозатрат,СтрокаТрудозатрат);
							НСТрудозатрат.РемонтыОборудования_ID = РемонтыОборудования_ID;
							НСТрудозатрат.ID = ИДРаботы;
						КонецЦикла;
					Иначе
						НСТрудозатрат = ДокументОбъект.ТрудовыеЗатраты.Добавить();
						ЗаполнитьЗначенияСвойств(НСТрудозатрат,СтрокаТрудозатрат);
						НСТрудозатрат.РемонтыОборудования_ID = РемонтыОборудования_ID;
						НСТрудозатрат.ID = ИДРаботы;
					КонецЕсли; 

				КонецЦикла;	
			КонецЕсли;

			Если ИнструментыИТехника <> Неопределено Тогда
				МассивСтрок = ИнструментыИТехника.НайтиСтроки(новый Структура("ID",СтрокаОперации.ID));
				Для каждого СтрокаИИТ Из МассивСтрок Цикл
					нс = ДокументОбъект.Инструменты.Добавить();
					ЗаполнитьЗначенияСвойств(нс,СтрокаИИТ);
					нс.РемонтыОборудования_ID = РемонтыОборудования_ID;
					нс.ID = ИДРаботы;
					нс.ЕдиницаИзмерения = СтрокаИИТ.Упаковка;
					нс.Количество = СтрокаИИТ.КоличествоУпаковок;
				КонецЦикла;	
			КонецЕсли;

			Если МерыБезопасности <> Неопределено Тогда
				МассивСтрок = МерыБезопасности.НайтиСтроки(новый Структура("ID",СтрокаОперации.ID));
				Для каждого СтрокаМБ Из МассивСтрок Цикл
					нс = ДокументОбъект.МерыБезопасности.Добавить();
					ЗаполнитьЗначенияСвойств(нс, СтрокаМБ);
					нс.РемонтыОборудования_ID = РемонтыОборудования_ID;
					нс.ID = ИДРаботы;
				КонецЦикла;	
			КонецЕсли;

		ИначеЕсли ТипЗнч(РемРабота.РемонтнаяРабота) = Тип("СправочникСсылка.торо_ИдентификаторыТехКарт") Тогда

			ТехКартаВложенная = РегистрыСведений.торо_ВерсииТехКарт.ПолучитьВерсиюТехКарты(РемРабота.РемонтнаяРабота, Новый Граница(ТехКарта.ДатаПринятия, ВидГраницы.Включая));

			СтруктураДанных = Новый Структура("ID_Родителя, РемонтнаяРабота, РемонтыОборудования_ID, Количество, ДатаРемонта"
			, ИДРаботы
			, ТехКартаВложенная
			, РемонтыОборудования_ID
			, СтрокаОперации.Количество
			, ДатаНачала);

			ДополнитьСписокОперацийДокументаИЗатраты(СтруктураДанных, ДокументОбъект, ЭтоРегламентныеМероприятия);

		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

&ИзменениеИКонтроль("ПроверитьВозможностьВводаНаОсновании")
Процедура гкс_ПроверитьВозможностьВводаНаОсновании(Основание, Отказ, ВыводитьСообщение)
	#Вставка
	Если ТипЗнч(Основание) = Тип("Структура") Тогда 
		Возврат;
	КонецЕсли;
	#конецВставки
	Если ЗначениеЗаполнено(Основание)
		И Не Основание.Проведен Тогда
		Если ВыводитьСообщение Тогда
			ТекстСообщения = НСтр("es='La creación del documento es posible solamente en razon del documento pasado.';ru='Создание документа возможно только на основании проведенного документа.';en='Creating a document is possible only on the basis of the document.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		Отказ = Истина;
	КонецЕсли;	
	#Вставка
	// гкс+ [Релиз16] Деснол
	Если ЗначениеЗаполнено(Основание) Тогда 
	ВременнаяСтруктура = Новый Структура("СпособСогласования", Неопределено);
	ЗаполнитьЗначенияСвойств(ВременнаяСтруктура, Основание);
	Если ЗначениеЗаполнено(ВременнаяСтруктура.СпособСогласования) Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
           |	РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.гкс_РазрешеноСоздаватьПодчиненные КАК Флаг,
		   |	РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
           |ИЗ
           |	РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов 
		   |	КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов 
		   |	КАК РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов
           |		ПО (РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент = &Ссылка)
           |			И (РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = &Способ)
           |			И РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента 
		   |	= РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.Статус";
		Запрос.УстановитьПараметр("Ссылка", Основание.Ссылка);
		Запрос.УстановитьПараметр("Способ", ВременнаяСтруктура.СпособСогласования);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.Флаг = Ложь Тогда 
				Если ВыводитьСообщение Тогда
					ТекстСообщения = НСтр("es='';
					|ru='В статусе ""%1"" запрещен ввод на основании';
					|en='Input is prohibited in status ""%1""'");
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Строка(Выборка.Статус));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				КонецЕсли; 
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	КонецЕсли;
	// гкс- [Релиз16]
	#КонецВставки
КонецПроцедуры

// гкс+ [Релиз16] Деснол
Процедура гкс_ПроверитьВозможностьВводаНаОснованииСтарый(Основание, Отказ, ВыводитьСообщение = Истина)Экспорт
	Если ЗначениеЗаполнено(Основание)
		И Не Основание.Проведен Тогда
		Если ВыводитьСообщение Тогда
			ТекстСообщения = НСтр("es='La creación del documento es posible solamente en razon del documento pasado.';
			|ru='Создание документа возможно только на основании проведенного документа.';
			|en='Creating a document is possible only on the basis of the document.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли; 
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз16]

// гкс+ [Релиз16] Деснол
Процедура гкс_ПроверитьВозможностьВводаОтСтатуса(Объект, Отказ) Экспорт
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И Объект.ДокументыОснования.Количество() Тогда 
		МассивДокументов = Новый Массив();
		Для Каждого СтрокаТаблицы Из Объект.ДокументыОснования Цикл
			Если МассивДокументов.Найти(СтрокаТаблицы.ДокументОснование) = Неопределено Тогда 
				МассивДокументов.Добавить(СтрокаТаблицы.ДокументОснование);
			КонецЕсли;
		КонецЦикла;
		Запрос = Новый Запрос();
		Запрос.Текст = 
		"ВЫБРАТЬ
           |	РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.гкс_РазрешеноСоздаватьПодчиненные КАК Флаг,
		   |	РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента КАК Статус
           |ИЗ
           |	РегистрСведений.торо_ТекущиеСтатусыСогласованияДокументов 
		   |	КАК РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов
           |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.торо_НастройкиСтатусовСогласованияДокументов 
		   |	КАК РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов
           |		ПО (РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент В (&Ссылка))
           |			И (РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.СпособСогласования = 
		   | РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СогласуемыйДокумент.СпособСогласования)
           |			И РегистрСведенийторо_ТекущиеСтатусыСогласованияДокументов.СтатусДокумента 
		   |	= РегистрСведенийторо_НастройкиСтатусовСогласованияДокументов.Статус";
		Запрос.УстановитьПараметр("Ссылка", МассивДокументов);
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			Если Выборка.Флаг = Ложь Тогда 
					ТекстСообщения = НСтр("es='';
					|ru='В статусе ""%1%"" запрещен ввод на основании';
					|en='Input is prohibited in status ""%1%""'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1%", Строка(Выборка.Статус));
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
// гкс- [Релиз16]
